# # темплейты микросервисная структура 
# плюсы минусы и в каких компаниях используются    

# плюсы: ORM
# Миграции базы данных
# Аутентификация пользователя
# Панель администратора
# Формы

# разделение проекта на несаколько частей -> интегрировать готовые решения.

# беззопасный - предотвращает sql инъекции подделки межсайтовых запросов (CSRF).


# нет обратной совместимости 

# ангулр таййп скрипт айбиэм лотом аштиэлэс лотос побочные микросервисы на фласке
# sap .net 5, 6
# quasor 
# redis хэширование
# celery 
# не сильно болььшая нагрузка 

# удаленный рабочий стол
# кали линукс 

# он это просил открыть пока объянял 

# я просто записываю чтобы потом анализировать еще 

# а почему то что я рассказывала, ты не записала?
# я этто знала а вот религиощзное уже не записала   
# owasp, etc 
# интеграция кали линукс через докер    

# он объясняет как его проект работает   кали линукс это короче 
# испольуется в кибребещропасности типо 

# сделать самому кахут

# фаст апи фласк - скорость 
# спринг бут - чтобы всегда работала
# фласк гибче чем джанго но разработка больш евремени 

# хочешь картошку фри у меня в золодильнике здесь лежит